
# Задачи по спискам

# Задача 1
# Дан список fruits = ["яблоко", "банан", "вишня"]. Добавь элемент "апельсин" и удали первый элемент.
fruits = ["яблоко", "банан", "вишня"]
fruits.append("апельсин")
print(fruits)  # Вывод ['яблоко', 'банан', 'вишня', 'апельсин']
fruits.pop(0)
print(fruits)  # Вывод ['банан', 'вишня', 'апельсин']

# Задача 2
# Создай список numbers = [10, 20, 30, 40, 50] и выведи элементы с 1-го по 3-й включительно
numbers = [10, 20, 30, 40, 50]
new_numbers = numbers[1:4]
print(new_numbers)  # Вывод [20, 30, 40]

# Задача 3
# Дан список colors = ["red", "green", "blue"]. Замени второй элемент на "yellow"
colors = ["red", "green", "blue"]
colors[1] = "yellow"
print(colors)  # Вывод ['red', 'yellow', 'blue']

# Задача 4
# Создай список fruits = ["яблоко", "груша"] и vegetables = ["морковь", "огурец"]. Объедини их в products
fruits = ["яблоко", "груша"]
vegetables = ["морковь", "огурец"]
products = fruits + vegetables
print(products)  # Вывод ['яблоко', 'груша', 'морковь', 'огурец']

# Задача 5
# Создай список numbers = [1, 2, 3] и добавь элемент 4 с помощью метода append()
numbers = [1, 2, 3]
numbers.append(4)
print(numbers)  # Вывод [1, 2, 3, 4]

# Задача 6
# Дан список nums = [10, 20, 30, 40]. Удали элемент 30 с помощью метода remove()
nums = [10, 20, 30, 40]
nums.remove(30)
print(nums)  # Вывод [10, 20, 40]

# Задача 7
# Создай список fruits = ["яблоко", "банан", "киви", "апельсин"]. Выведи каждый элемент с помощью цикла for
fruits = ["яблоко", "банан", "киви", "апельсин"]
for fruit in fruits:
    print(fruit)

# Задача 8
# Создай список numbers = [3, 7, 2, 9]. Выведи каждый элемент, умноженный на 2
numbers = [3, 7, 3, 9]
for number in numbers:
    print(number * 2)

# Задача 9
# Создай список numbers = [1, 2, 3, 4, 5]. Выведи квадраты только чётных чисел
numbers = [1, 2, 3, 4, 5]
for number in numbers:
    if number % 2 == 0:
        print(number ** 2)

# Задача 10
# Создай список names = ["Анна", "Иван", "Мария", "Пётр"]. Выведи имена, пропуская "Мария"
names = ["Анна", "Иван", "Мария", "Пётр"]
for name in names:
    if name == "Мария":
        continue
    print(name)

# Задача 11
# Дан список food = ["хлеб", "сыр", "молоко", "вода"]. Останови цикл при встрече "молоко"
food = ["хлеб", "сыр", "молоко", "вода"]
for item in food:
    if item == "молоко":
        break
    print(item)